class Script:
    
    def __init__(self):
        
        #方舱文案
        self.positive = "\n突如其来的敲门声打断了快乐的游戏时光，你透过猫眼向外看，门口站着三个大白。\n\n尽管你的健康云一直显示为阴性，但防疫工作人员仍然坚持要带你去方舱医院走一遭.\n双方进行了坦率交谈，充分交换了意见，增加了对彼此的了解。\n最终你同意前往方舱，毕竟在方舱根本不愁吃喝。\n\n转运的路上，你注意到路上的梧桐叶已经变得茂盛起来。\n平时熙熙攘攘的大街，如今只有马不停蹄的快递小哥，和无名无姓的铁面大白。"
        self.positive_luck = "\n很幸运，你前往的是会展中心方舱，条件极好。"
        self.positive_fuck = "\n很遗憾，你所前往的方舱没有床位。你被遣返回了小区。\n但由于你是阳性，小区的工作人员拒绝放你进去。\n你成为了无家可归的流浪汉，只能流落接头。\n唯一欣慰的是，你并不孤胆，像你一样零零散散在大街上的有十多个人。\n你们像梧桐叶一样，被时代的动荡吹的漫天都是。\n\n你心理有一万句fuck要说\n但眼下当务之急是,给自己找一个栖身之所。"
        self.positive_fuck2 = "你给自己找了一个有屋檐的街边，垫上随身的衣物。\n正当你准备睡下时，天上开始下起了细雨。\n于是你不得不另寻他处。\n\n你跟着队伍，经过零星散落的几个帐篷后，走进了一个桥洞,\n桥下睡着20多个外卖小哥。\n你注意到桥洞里有几个插口，上面连着三四条插板，插满了充电器。\n空气中弥漫着难闻的气味。\n你觉得你不应该住在这里，但你别无选择。"
        self.positive_fuck3 = "你不停给12345打电话，最终成功拨通了一次。\n对方帮你在另一个方舱找到了床位。\n但你仍然需要在外面委屈一个晚上。\n\n你终于能松下一口气，刚闭上眼，一股睡意席卷而来。\n在你所睡的位置有一个广告牌，上面写着：\n\n你所热爱的，就是你的生活。\n\n尽管一波三折，最终你还是抵达了方舱。\n至于天桥的其它人，只能自求多福。"
        self.negative1 = "\n你在过去24小时的两次核酸结果都呈阴性\n因此你顺利地拿到了解离书。\n方舱的专车将你们送到街道门口便匆匆离去。\n虽然七天没有回家，但你并不急急着回小区。\n即便你是一个肥宅，你依然享受伴着晚风在梧桐树下慢慢行走的时光。\n横沙的街头总是熙熙攘攘，你从未见过这里的街道能如此宁静祥和。\n\n从街道入口走到小区门口并没有花多少时间。\n工作人员在确认了你的身份和解离书后，将你放进了小区。\n谢天谢地，你并没有像网上流传的那样无家可归。"
        self.negative2 = "\n你在过去24小时的两次核酸结果都呈阴性\n因此你顺利地拿到了解离书。\n方舱的专车将你们送到街道门口便匆匆离去。\n虽然七天没有回家，但你并不急急着回小区。\n即便你是一个肥宅，你依然享受伴着晚风在梧桐树下慢慢行走的时光。\n横沙的街头总是熙熙攘攘，你从未见过这里的街道能如此宁静祥和。\n\n从街道入口走到小区门口并没有花多少时间。\n\n"

        #赛博文案
        self.cyber_firstday = "为了让自己的心态保持平和，你选择让自己与现实脱钩，再一次隐身于伟大的互联网。\n\n但很快你发现，不同空间与不同时间的负面情绪都汇集于此，\n互联网所展现出来的横沙比你自身感受到的要严峻得多。\n无奈之下，你打开了Steam，这里有着上千款你买来从未玩过的游戏等待着你的幸临。\n"
        
        #结尾文案
        self.end_mood = "也许是因为财务免疫力强，你在封城期间尽可能保持着乐观的心态。\n你依然相信，这个世界依然会有崭新的明天。"
        self.end_zmz = "你在方舱认识的姑娘日后依然会经常联系\n你们经常畅聊到深夜，一同聊诗与远方。"
        self.end_1 = "\n正当你渐入梦乡时，你被楼下巨大的欢呼声所惊醒。\n你探过窗户向下看，看见整个小区都张灯结彩，亮如白昼。\n绿化带中心的花圈闪烁着星点般的光彩。\n人们用蜡烛在一旁摆出四个大字：\n横——沙——加——油\n\n一群大白在花坛旁围城一圈，手举灯光，随着音乐一起摇摆。\n你马上就听出来这首曲子是什么。\n这首从小学听到大的《歌唱祖国》在这一刻给予了你从未有过的感动。\n\n你已经猜到了发生了什么，但你依然打开微信再次确认。\n居委在业主群里郑重宣布了解封事宜以及今后的管理措施。\n\n恭喜，你撑到了解封的那天。"
        self.end = "当你在日后回顾这段经历时，你会意识到：\n封城的高压使你的心态发生了微妙的，不可逆的转变。\n\n你知道黄昏正在转瞬即逝，黑夜从天而降了。\n你看到广阔的土地袒露着结实的胸膛，那是召唤的姿态，\n就像女人召唤着她们的儿女，土地召唤着黑夜来临。"
        self.end_reputation = "你在这场灾难中尽可能帮助了其它人。\n尽管他们不知道你的名字，但在多年之后，\n9527这一房号依然会在他们脑海中留有印象。"
        self.end_arc = "你在封城期间不幸感染了病毒，被拉倒了方舱隔离。"
        self.end_arc_none = "你善于保护自己，在封城期间没有被感染。"
        self.end_arc_travel = "你不幸流落街头。切身体会到了什么叫“风餐露宿”\n在日后的生活中，你会更为珍视当下的所有。"

        #固定事件
        self.days= {
            '1':'突然起来的封城令所有横沙人都措手不及，但你是一名死肥宅。\n由于平时有囤积物资的意识，封城并没有对你造成太多的困扰。\n你的同事并没有那么好运，他们当中有些人平时靠外卖度日，在封城前只准备了不到一周的干粮，他们开始对可能迎来的食品短缺感到不安。\n这种焦虑很快蔓延到了整个公司，居家办公的效率自然无从谈起。',
            '3':'你六点不到便被叫起来去做核酸，小区内排起了长长的队伍。\n此起彼伏的喇叭播报让你萌生出了十七号城市的幻视，只不过这次你听到的是熟悉的语言。\n最近的一个喇叭喊着：“请准备核酸码”；\n稍远的那个重复着“请准备好身份证。”\n最远的那个则不停提醒大家保持二米间隔。\n但并没有人遵守这一点。',
            '5':'五天过去，城市依然没有解封。业主群逐渐开始因为粮食储备感到不安,开始筹备团购事宜。\n你仔细观察了一下，八成以上的团长都是女性。不难想象其它小区也是如此。\n\n比起自由，你更先失去的是自己的名字，从今天开始大家只会叫你作房号9527。\n明白了没有，房号9527？',
            '7':'第一批政府物资到了。\n尽管只有一箱安慕希和一袋大米，但这对很多人而言无异于雪中送炭。\n小区里的紧张程度有所缓解。\n物业开始统计每家每户基本保障以外的需求。',
            '9':'政府宣布了三区划分标准，你所在的小区被划分为了红灯区。\n理论上大家都应该足不出户，但似乎只有你在遵守这一规定。\n楼下的绿地净是遛狗散步的老年人。',
            '14':'第二批政府物资到了，你的库存补充了不少青菜。\n整理完物资后，你突然意识到第一个十四天已经过去了。\n确切的讲，过去的每一天都是十四天的第一天。',
            '16':'你下楼测核酸的时候发现，居委在一楼大堂张贴告示：\n要求团长在开团前24小时必须向居委报备。\n团长需要提供司机的核酸报告、行程码、健康码、抗原自测。\n团长还需要负责物资的接受、搬运、消杀、配送。\n团长不得团购白名单以外的物资，比如说肥宅最喜欢的可乐。\n此通告在业主群里搅起轩然大波。',
            '21':'第三批政府物资到了，这本该是值得庆幸的事。\n但你很快注意到不少物资似乎是假冒伪劣产品,\n比如酱鸭包装二维码上的生产日期比印的还要早两年\n花生油的生产日期比到手时间还要晚半个小时。\n有居民已经吃坏了肚子，居委决定上门回收所有的物资。',
            '23':'居委听从上级指使，开始对居民楼进行硬隔离。\n你楼上的老外对着居委喊了一万句fuck。\n感谢老外，居委最终妥协拆掉了围栏。',
            
        }

        #八股文案
        self.operations = {
            '1':'打赢疫情防控大仗硬仗。',
            '3':'尽锐出战，攻坚克难。',
            '5':'做到四应四尽、打赢疫情防控攻坚战。',
            '8':'打赢疫情防控攻坚战。',
            '10':'咬紧牙关持续奋战。',
            '11':'疫情防控攻坚战。',
            '15':'全力以赴攻坚。',
            '17':'以快制快。',
            '18':'决战冲锋、攻坚克难。',
            '20':'打赢社会面清零攻坚战。',
            '21':'开展九大攻坚行动。',
            '25':'上下同心，尽锐出战。',
            '23':'抓紧推进硬隔离工作。',
            '28':'坚决打赢疫情防控阻击战歼灭战。',

        }
             

        self.random_quests = [
                #危险度1事件
                [
                    {
                        "id":1,
                        "fields":{
                            "description":"任务简介",
                            "type":"检定类型wealth,strength,Ingenuity,Cyber",
                            "value":"检定数值",
                            "succeed":"检定成功文本",
                            "fail":"检定失败文本",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":25,
                        "fields":{
                            "description":"测完核酸回程的途中，你听到邻居两夫妇在不停争吵。\n出于好奇，你决定凑上去看看发生了什么事。\n原来是丈夫团购一根菜没买，而是买了三箱可乐和数十条香烟。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你马上意识到，在物资短缺的时期，人民币会退出流通市场。\n香烟、啤酒和可乐将会是这一时期的硬通货。\n处于戒断反应的烟民们会为了这些东西付出一切代价。\n如果再封一个月，你眼前的这个男人将会成为小区里最富有的男人。\n你对着男人微微一笑，随即转身回到了自己的房间。",
                            "fail":"你上前一同谴责丈夫这种，只顾自己享乐全然不顾家庭的举动。",
                            "succeed_type":['mood'],
                            "succeed_value":['1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },                                                                    
                    {
                        "id":2,
                        "fields":{
                            "description":"在排队测核酸时，你闲的无聊刷微博，\n看到横沙发布说今天的确诊只有300例。",
                            "type":"Ingenuity",
                            "value":"4",
                            "succeed":"你觉得事有蹊跷，一探究竟后发现果然还有2000例无症状感染者。",
                            "fail":"你相信电视所言，觉得疫情很快就能过去。",
                            "succeed_type":['default','default'],
                            "succeed_value":['1','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['1','1'],

                        }

                    },
                    {
                        "id":30,
                        "fields":{
                            "description":"你注意到测核酸的队伍里有人人西装革履，有人衣着光鲜，有人油头粉面。\n好像测得不是核酸，测的是小资情调。",
                            "type":"wealth",
                            "value":"10",
                            "succeed":"你决定参与这场狂欢\n你从衣柜里取出了自己最为昂贵的夹克。\n它的背上印有两个显眼的印花：\n左边写的是“溺水三千，只取一尿饮”，\n右边写的是“花花世界，我一人干翻”。\n你的回头率达到了百分之三百。",
                            "fail":"你是一位实用主义者，你无法理解这种搔首弄姿的行为。\n你穿着拖鞋大裤衩，在队伍中成为了最亮眼的仔。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },                    
                 
                ], 
                #危险度2事件
                [
                    {
                        "id":1,
                        "fields":{
                            "description":"任务简介",
                            "type":"检定类型wealth,strength,Ingenuity,Cyber",
                            "value":"检定数值",
                            "succeed":"检定成功文本",
                            "fail":"检定失败文本",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":2,
                        "fields":{
                            "description":"在排队测核酸时，你闲的无聊刷微博，\n看到横沙发布说今天的确诊只有300例。",
                            "type":"Ingenuity",
                            "value":"4",
                            "succeed":"你觉得事有蹊跷，一探究竟后发现果然还有2000例无症状感染者。",
                            "fail":"你相信电视所言，觉得疫情很快就能过去。",
                            "succeed_type":['immune','default','default'],
                            "succeed_value":['-1','1','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['1','1'],

                        }

                    },
                    {
                        "id":3,
                        "fields":{
                            "description":"你得知邻居家团购的鸡被偷走了，愤怒至极。",
                            "type":"Ingenuity",
                            "value":"8",
                            "succeed":"你灵机一动，去居委调监控，发行作案人竟然是只流浪猫。\n作为感谢，邻居送了你五颗鸡蛋",
                            "fail":"你义愤填膺，一同谴责这种失德行为。",
                            "succeed_type":['mood','eggs','reputation'],
                            "succeed_value":['1','5','1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],

                        }

                    },
                    {
                        "id":4,
                        "fields":{
                            "description":"你注意到头顶有异物飞过，原来是住顶楼的邻居开始翻出了吃灰多年的无人机，试图从观景池钓锦鲤。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你认出了无人机的型号，是你在大学偷拍时用过的那款。\n你向邻居借来了无人机，只尝试了一次便钓上来了一条锦鲤。\n你用锦鲤换来了3颗鸡蛋。",
                            "fail":"你对此一窍不通,向他投出羡慕的眼光。",
                            "succeed_type":['mood','default'],
                            "succeed_value":['3','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['1','1'],

                        }

                    },
                    {
                        "id":5,
                        "fields":{
                            "description":"分发物资时，传来了一一阵喧闹声。\n一个老头执意认为物资应按照房子户数分发，并抢来了两盒鸡蛋。",
                            "type":"strength",
                            "value":"5",
                            "succeed":"你乘其不备，迅速制服了老头。居委奖励了你3颗鸡蛋。",
                            "fail":"你是一个肥宅，对方沙包那么大的拳头可以一拳将你击倒在地，你选择坐山观虎斗。\n老头被众人围住，情急之下，只能将抢来的鸡蛋砸倒在地。",
                            "succeed_type":['mood','eggs','reputation'],
                            "succeed_value":['1','3','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['-1','1'],

                        }

                    },
                    {
                        "id":6,
                        "fields":{
                            "description":"你注意到，业主群里开始分享水培蔬菜的经验，因为葱姜蒜在菜包里往往不会出现。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你心灵手巧，很快掌握了种葱的要义。\n每一个漂亮的瓶子都逃不开种葱的命运。",
                            "fail":"你试图参与进去，但你是一个肥宅，你生来就属于伟大的互联网，对需要亲自动手的事无能为力。",
                            "succeed_type":['mood','default'],
                            "succeed_value":['3','1'],
                            "fail_type":['default','default'],
                            "fail_value":['1','1'],

                        }

                    },
                    {
                        "id":7,
                        "fields":{
                            "description":"小区团购的物资到了。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你思维敏锐，很快注意到蔬菜包表面残破不堪的标签与云南送来的物资很像\n你马上报了警，警方很快就将倒卖物资的人就地正法。",
                            "fail":"十斤菜居然起价300，明抢吧。奸商sigma先。",
                            "succeed_type":['mood','default','reputation'],
                            "succeed_value":['3','1','1'],
                            "fail_type":['default','default'],
                            "fail_value":['-3','1'],

                        }

                    },
                    {
                        "id":8,
                        "fields":{
                            "description":"你沉迷打魔兽，一直魔兽一直爽，封城的日子对肥宅而言真的太棒了。",
                            "type":"Cyber",
                            "value":"6",
                            "succeed":"你身经百战。区区魔兽并不足以让你忘却现实世界。\n你依然尽了一个公民应检尽检的义务，每次都服从安排参与全面核酸。",
                            "fail":"你沉迷魔兽，无暇顾及全民核酸，最终被警方找上门来，吃了200元的行政罚款。",
                            "succeed_type":['mood','default'],
                            "succeed_value":['2','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['-5','1'],

                        }

                    },
                    {
                        "id":9,
                        "fields":{
                            "description":"有人托关系搞到了购买肥宅快乐水的渠道，问你要不要一起参与。",
                            "type":"wealth",
                            "value":"8",
                            "succeed":"你是一名肥宅，平时除了吃饭打游戏以外几乎没有别的花销，所以有足够的存款供你挥霍。\n你下单买了20瓶快乐水。\n虽然贵，但你喝的就是快乐。",
                            "fail":"20瓶快乐水加上跑腿费，要花1000块大洋。\n你囊中羞涩，无力承担。\n对方只好一人成团买了10箱可乐，被渠道商叫做独立团团长。",
                            "succeed_type":['mood','default'],
                            "succeed_value":['5','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['1','1'],

                        }

                    },
                    {
                        "id":10,
                        "fields":{
                            "description":"住在你隔壁的老人对线上支付并不熟悉，随即向你求助帮忙购买面粉",
                            "type":"Cyber",
                            "value":"1",
                            "succeed":"你很爽快地帮她付了钱。\n过了一会，老人过来还现金给你时还额外递了张字体，\n只见上面用行楷写着：\n春日\n胜日寻芳泗水滨,\n湖边光景一时新。\n等闲识得东风面，\n万紫千红总是春。\n赠热心小朋友\n天启壬戌年。",
                            "fail":"地球在上，怎么会有肥宅连上网都不会的。",
                            "succeed_type":['mood','default','reputation'],
                            "succeed_value":['1','1','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['-1','1'],
                        }

                    },
                    {
                        "id":11,
                        "fields":{
                            "description":"你在睡午觉时，被阵阵哭声吵醒，\n原来是一名女子在四处敲门，哭着求退烧药。\n看的出来她病的很厉害。",
                            "type":"wealth",
                            "value":"6",
                            "succeed":"你提前准备了充足的物资，其中包括了现在市面上买不到退烧药。\n你将退烧药放进塑料袋里，挂在门把手上，在业主群里报上了自己的门牌号9527。\n过了一会，那位女子在业主群里对你说了句谢谢。",
                            "fail":"你对此无能为力，心理很不是滋味。",
                            "succeed_type":['mood','default','reputation'],
                            "succeed_value":['2','1','1'],
                            "fail_type":['mood','default'],
                            "fail_value":['-5','1'],
                        }

                    },
                    {
                        "id":12,
                        "fields":{
                            "description":"今天楼下测核酸的动静要远比平时热闹，\n你侧耳倾听，试图去了解发生了什么。",
                            "type":"strength",
                            "value":"5",
                            "succeed":"健康的身体使你的听力比常人更为敏锐。\n你很快意识到监测点多了维护秩序的保安，他用喇叭不停喊道：\n你也不要唱听我说谢谢你，\n你也不要跳听我说谢谢你，\n你测完核酸能赶紧滚蛋我就谢谢你了",
                            "fail":"你什么也听不清，长时间戴耳机一定程度上损伤了你的听觉。",
                            "succeed_type":['mood','default'],
                            "succeed_value":['2','1'],
                            "fail_type":['default','default'],
                            "fail_value":['1','1'],
                        }

                    },
                    {
                        "id":13,
                        "fields":{
                            "description":"你无意中找到了一个低价跑腿的渠道，购买了24个鸡蛋。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你想起有不少跑腿小哥为了避免困在小区里，最近一直睡在桥洞和绿化带中。\n为了避免感染，你让他将鸡蛋拴在了小区护栏上。过一会再亲自去领取。",
                            "fail":"你前往接头地点一手交钱一手交货，取回了鸡蛋。\n丝毫没有意识到自己面临感染的风险。",
                            "succeed_type":['eggs'],
                            "succeed_value":['24'],
                            "fail_type":['eggs','immune'],
                            "fail_value":['24','-2'],
                        }

                    },
                    {
                        "id":14,
                        "fields":{
                            "description":"今天楼下测核酸的动静要远比平时热闹，\n你侧耳倾听，试图去了解发生了什么。",
                            "type":"strength",
                            "value":"5",
                            "succeed":"健康的身体使你的听力比常人更为敏锐。\n你很快意识到检查点多了科普通识的大白，他用喇叭疲惫地念着：\n“我吹过你吹过的风,这算不算相拥？\n算，算密接。\n我走过你走过的路，这算不算相逢？\n也算，算次密接。”",
                            "fail":"你什么也听不清，长时间戴耳机一定程度上损伤了你的听觉。",
                            "succeed_type":['mood','default'],
                            "succeed_value":['2','1'],
                            "fail_type":['default','default'],
                            "fail_value":['1','1'],
                        }

                    },
                    {
                        "id":15,
                        "fields":{
                            "description":"你在电视上看到，全球汽车芯片巨头IMESNO半导体突然宣布将关闭位于横沙的全球配送中心并将其迁往新加坡。",
                            "type":"Ingenuity",
                            "value":"8",
                            "succeed":"巨大的思潮在你脑海中涌起，你意识到：\n作为中国最为庞大的汽车集群地之一，横沙此次停产的影响正逐步发酵，并且会愈演愈烈\n十七家上市公司，上千家大规模零部件企业，两万家小微企业\n他们每年贡献汽车产量283万，产值9000亿元。\n随着时间的流逝，这些企业会不断向国外转移\n如果五月份再不复工，往后就没有复工的必要了。\n想到这里，你陷入了深深的绝望当中。",
                            "fail":"你心想：“人还没润，工作岗位先润了，这下真的同舟共寄了。”",
                            "succeed_type":['mood','default'],
                            "succeed_value":['-10','1'],
                            "fail_type":['default','default'],
                            "fail_value":['1','1'],
                        }

                    },
                    {
                        "id":16,
                        "fields":{
                            "description":"隔壁的邻居粮食储备不够，找上门来提出用猫的使用权来换几枚鸡蛋。",
                            "type":"eggs",
                            "value":"10",
                            "succeed":"没有人能拒绝猫猫的诱惑，你用三枚鸡蛋换来他家的猫猫把玩了一个小时。",
                            "fail":"没有人能拒绝猫猫的诱惑，但你目前的储备也所剩无几，只好痛心拒绝这一请求。",
                            "succeed_type":['eggs','mood'],
                            "succeed_value":['-3','3'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":17,
                        "fields":{
                            "description":"粉红色的天空下着玫瑰色的细雨。\n你像往常一样听从指示下楼测核酸。\n突然，前方传来了一阵喧哗声，周围的人解释说\n有家长让小孩跳《听我说谢谢你》，\n后面的人嫌浪费时间，就打了起来。",
                            "type":"strength",
                            "value":"9",
                            "succeed":"你的脑海中复现出一句诗：\n若是路遇不平事，纵酒挥刀斩人头。\n你身强力壮，冲上前去一人扇了一个耳光。\n你的气势震慑住了冲突双方的所有人，双方不得不握手言和。",
                            "fail":"双方打的头破血流，这样的场面不是肥宅所能应对的。\n你默默退到一边，打110求助，让人民公仆来摆平这一切。",
                            "succeed_type":['mood'],
                            "succeed_value":['3'],
                            "fail_type":['mood'],
                            "fail_value":['-3'],
                        }

                    },
                    {
                        "id":18,
                        "fields":{
                            "description":"今天的核酸检测点看起来和以往有些不太一样，\n负责扫码的医护人员面前多了个大纸箱，\n他在里面透过小洞来检测每一个人的二维码",
                            "type":"Ingenuity",
                            "value":"4",
                            "succeed":"你仔细一想，此举是为了减少扫码时太阳的反光，提高扫码效率。\n简单但实用，这就是劳动人民的智慧。",
                            "fail":"你没有多想，跟着人群向前走去。",
                            "succeed_type":['mood'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":19,
                        "fields":{
                            "description":"你在测核酸的时候，注意到小区的绿地和平时有些不太一样。\n你仔细一看，看到小区的阿姨们在挥动锄头，将草地改成菜园。",
                            "type":"strength",
                            "value":"7",
                            "succeed":"你牛高马大，自知能力越大责任越大，便上前去一同帮忙。",
                            "fail":"你是一个肥宅，你生来就属于伟大的互联网，对需要亲自动手的事无能为力。",
                            "succeed_type":['immune'],
                            "succeed_value":['-1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":20,
                        "fields":{
                            "description":"长期的封城给大家带来了巨大的精神压力.\n这晚，居民们开始一同敲碗呐喊以倾泄情绪。",
                            "type":"strength",
                            "value":"4",
                            "succeed":"你五感发达，听觉敏锐。\n你努力在潮水一样涌来的喊话中分清当中的内容\n有人喊“物资”，有人喊“解封”，\n但在所有这些嘈杂中，你隐隐约约捕捉到一丝————\n\n我——想——做——爱!!!",
                            "fail":"你无法听清他们在说什么，只觉得他们非常吵闹。\n你带上耳机，继续打魔兽。",
                            "succeed_type":['mood'],
                            "succeed_value":['2'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":21,
                        "fields":{
                            "description":"抢菜成为了每个横沙人生活的一部分，但你是一个例外，毕竟你早已囤积了足够多的物资。\n更为重要的是，早上6点起床对一个肥宅而言还是太艰难了。\n但最终，你还是决定帮助自己的邻居做点什么。",
                            "type":"Cyber",
                            "value":"8",
                            "succeed":"你很快意识到靠人力抢菜只能靠运气，于是着手开始编写抢菜脚本。\n很快，你帮邻居抢来了足够多的物资。",
                            "fail":"你很快就意识到人力抢菜只能靠运气，尝试了几次便放弃了。",
                            "succeed_type":['mood','reputation'],
                            "succeed_value":['5','1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    }, 
                    {
                        "id":22,
                        "fields":{
                            "description":"你得知你的邻居开始辟谷，并不是因为缺少粮食，而是因为手纸短缺",
                            "type":"wealth",
                            "value":"5",
                            "succeed":"你事先囤积了大量的物资，手纸自然也不在话下。\n你将手纸放到塑料袋挂在了门口提醒邻居来拿\n到了晚上，塑料袋中的手纸变为了6枚鸡蛋。",
                            "fail":"尽管你囤积了一定的物资，但自己很快也要面临弹尽粮绝的境地。",
                            "succeed_type":['eggs'],
                            "succeed_value":['6'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":23,
                        "fields":{
                            "description":"你的邻居不慎被菜刀割到了手，血流不止。\n他上门找你求助。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你注意到手指只是慢慢向外渗血，大概率是静脉受伤。\n你给他采取了压迫止血，你知道用动脉止血方法的话手指可能会坏死。\n邻居辗转去了四个医院也没能打上破伤风疫苗。\n你在简陋的条件下，给他消毒包扎。\n你的邻居对你致以最为诚挚的谢意。",
                            "fail":"你完全不知道该如何处理这种情况。只能帮他打120，然后默默祈祷救护车会按时到来。",
                            "succeed_type":['immune','reputation'],
                            "succeed_value":['-2','1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":24,
                        "fields":{
                            "description":"测完核酸后，你遥遥看见小区外面砌起了一面红色的砖墙。",
                            "type":"strength",
                            "value":"4",
                            "succeed":"你定睛一看，意识到构成这堵墙的不是砖头，而是一箱箱泡面。",
                            "fail":"你没有多想，以为又是是哪个领导搞出来的花活。。",
                            "succeed_type":['mood'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":25,
                        "fields":{
                            "description":"测完核酸回程的途中，你听到邻居两夫妇在不停争吵。\n出于好奇，你决定凑上去看看发生了什么事。\n原来是丈夫团购一根菜没买，而是买了三箱可乐和数十条香烟。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你马上意识到，在物资短缺的时期，人民币会退出流通市场。\n香烟、啤酒和可乐将会是这一时期的硬通货。\n处于戒断反应的烟民们会为了这些东西付出一切代价。\n如果再封一个月，你眼前的这个男人将会成为小区里最富有的男人。\n你对着男人微微一笑，随即转身回到了自己的房间。",
                            "fail":"你上前一同谴责丈夫这种，只顾自己享乐全然不顾家庭的举动。",
                            "succeed_type":['mood'],
                            "succeed_value":['1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":26,
                        "fields":{
                            "description":"你无意中看到了一名基层人员写的公开信，标题为《夏天快来了》。",
                            "type":"Ingenuity",
                            "value":"8",
                            "succeed":"你读完开头便意识到，作者赌上了自己的职业生涯来发这篇文章。\n文章中提到，自己已经连轴转了十天，每天只能睡2-3个小时。\n超过4000人的的基本保障压在了居委8个人身上。\n超过26个楼道的生活垃圾，让保洁工处于崩溃和罢工的边缘。\n文章还抱怨道，上级总是下死命令，但下命令的人从没亲临前线。\n文章的最后，他坦言到，自己已经无力承担和回答居民们的诉求。\n你读完文章后，久久不能释怀。",
                            "fail":"文章写的太长了，你没有耐心看下去。\n你只瞟了两眼，就继续打魔兽去了。",
                            "succeed_type":['mood'],
                            "succeed_value":['-3'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":27,
                        "fields":{
                            "description":"晚上，你凭栏望月，忽然听到的浅浅歌声的歌声从远方飘来。\n你依稀能听到“夜上海，夜上海”这样的字眼。",
                            "type":"strength",
                            "value":"8",
                            "succeed":"你侧耳倾听，意识到歌词与原版差别很大。你依稀能听到：\n“...菜价翻，几百起。\n过期肥肉来供应。\n被关着，难收货。\n经济凋零...”\n你试图继续去捕捉剩下的歌词，但歌声逐渐暗淡了下去。",
                            "fail":"你对陈年老曲毫无兴趣，决定回到自己的座位上，继续老头环。",
                            "succeed_type":['mood'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":28,
                        "fields":{
                            "description":"你在微博上看到了街道办发的情况通报，\n正文内容石锤了倒卖抗疫物资的现象，\n并指出罪魁祸首张某已经被公安机关控制。",
                            "type":"Ingenuity",
                            "value":"3",
                            "succeed":"你意识到通报中的物资有190箱，加起来有快1.3吨。\n这绝非一人能做到的事,被推出来的大概率是背锅侠。",
                            "fail":"看到奸商落网，你拍手叫好。",
                            "succeed_type":['mood'],
                            "succeed_value":['-2'],
                            "fail_type":['mood'],
                            "fail_value":['2'],
                        }

                    },   
                    {
                        "id":29,
                        "fields":{
                            "description":"灌水文档。",
                            "type":"Ingenuity",
                            "value":"3",
                            "succeed":"测试",
                            "fail":"测试。",
                            "succeed_type":['mood'],
                            "succeed_value":['0'],
                            "fail_type":['mood'],
                            "fail_value":['0'],
                        }

                    },                                                                                                                                                                                                                   

                ],
                #危险度3事件
                [

                    {
                        "id":1,
                        "fields":{
                            "description":"任务简介",
                            "type":"检定类型wealth,strength,Ingenuity,Cyber",
                            "value":"检定数值",
                            "succeed":"检定成功文本",
                            "fail":"检定失败文本",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":13,
                        "fields":{
                            "description":"你无意中找到了一个低价跑腿的渠道，购买了24个鸡蛋。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你想起有不少跑腿小哥为了避免困在小区里，最近一直睡在桥洞和绿化带中。\n为了避免感染，你让他将鸡蛋拴在了小区护栏上。过一会再亲自去领取。",
                            "fail":"你前往接头地点一手交钱一手交货，取回了鸡蛋。\n丝毫没有意识到自己面临感染的风险。",
                            "succeed_type":['eggs'],
                            "succeed_value":['24'],
                            "fail_type":['eggs','immune'],
                            "fail_value":['24','-2'],
                        }

                    },
                    {
                        "id":19,
                        "fields":{
                            "description":"你在测核酸的时候，注意到小区的绿地和平时有些不太一样。\n你仔细一看，看到小区的阿姨们在挥动锄头，将草地改成菜园。",
                            "type":"strength",
                            "value":"7",
                            "succeed":"你牛高马大，自知能力越大责任越大，便上前去一同帮忙。",
                            "fail":"你是一个肥宅，你生来就属于伟大的互联网，对需要亲自动手的事无能为力。",
                            "succeed_type":['immune'],
                            "succeed_value":['-1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":23,
                        "fields":{
                            "description":"你的邻居不慎被菜刀割到了手，血流不止。\n他上门找你求助。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你注意到手指只是慢慢向外渗血，大概率是静脉受伤。\n你给他采取了压迫止血，你知道用动脉止血方法的话手指可能会坏死。\n邻居辗转去了四个医院也没能打上破伤风疫苗。\n你在简陋的条件下，给他消毒包扎。\n你的邻居对你致以最为诚挚的谢意。",
                            "fail":"你完全不知道该如何处理这种情况。只能帮他打120，然后默默祈祷救护车会按时到来。",
                            "succeed_type":['immune','reputation'],
                            "succeed_value":['-2','1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":13,
                        "fields":{
                            "description":"你无意中找到了一个低价跑腿的渠道，购买了24个鸡蛋。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你想起有不少跑腿小哥为了避免困在小区里，最近一直睡在桥洞和绿化带中。\n为了避免感染，你让他将鸡蛋拴在了小区护栏上。过一会再亲自去领取。",
                            "fail":"你前往接头地点一手交钱一手交货，取回了鸡蛋。\n丝毫没有意识到自己面临感染的风险。",
                            "succeed_type":['eggs'],
                            "succeed_value":['24'],
                            "fail_type":['eggs','immune'],
                            "fail_value":['24','-2'],
                        }

                    },
                    {
                        "id":19,
                        "fields":{
                            "description":"你在测核酸的时候，注意到小区的绿地和平时有些不太一样。\n你仔细一看，看到小区的阿姨们在挥动锄头，将草地改成菜园。",
                            "type":"strength",
                            "value":"7",
                            "succeed":"你牛高马大，自知能力越大责任越大，便上前去一同帮忙。",
                            "fail":"你是一个肥宅，你生来就属于伟大的互联网，对需要亲自动手的事无能为力。",
                            "succeed_type":['immune'],
                            "succeed_value":['-1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":23,
                        "fields":{
                            "description":"你的邻居不慎被菜刀割到了手，血流不止。\n他上门找你求助。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你注意到手指只是慢慢向外渗血，大概率是静脉受伤。\n你给他采取了压迫止血，你知道用动脉止血方法的话手指可能会坏死。\n邻居辗转去了四个医院也没能打上破伤风疫苗。\n你在简陋的条件下，给他消毒包扎。\n你的邻居对你致以最为诚挚的谢意。",
                            "fail":"你完全不知道该如何处理这种情况。只能帮他打120，然后默默祈祷救护车会按时到来。",
                            "succeed_type":['immune','reputation'],
                            "succeed_value":['-2','1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":13,
                        "fields":{
                            "description":"你无意中找到了一个低价跑腿的渠道，购买了24个鸡蛋。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你想起有不少跑腿小哥为了避免困在小区里，最近一直睡在桥洞和绿化带中。\n为了避免感染，你让他将鸡蛋拴在了小区护栏上。过一会再亲自去领取。",
                            "fail":"你前往接头地点一手交钱一手交货，取回了鸡蛋。\n丝毫没有意识到自己面临感染的风险。",
                            "succeed_type":['eggs'],
                            "succeed_value":['24'],
                            "fail_type":['eggs','immune'],
                            "fail_value":['24','-2'],
                        }

                    },
                    {
                        "id":19,
                        "fields":{
                            "description":"你在测核酸的时候，注意到小区的绿地和平时有些不太一样。\n你仔细一看，看到小区的阿姨们在挥动锄头，将草地改成菜园。",
                            "type":"strength",
                            "value":"7",
                            "succeed":"你牛高马大，自知能力越大责任越大，便上前去一同帮忙。",
                            "fail":"你是一个肥宅，你生来就属于伟大的互联网，对需要亲自动手的事无能为力。",
                            "succeed_type":['immune'],
                            "succeed_value":['-1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":23,
                        "fields":{
                            "description":"你的邻居不慎被菜刀割到了手，血流不止。\n他上门找你求助。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你注意到手指只是慢慢向外渗血，大概率是静脉受伤。\n你给他采取了压迫止血，你知道用动脉止血方法的话手指可能会坏死。\n邻居辗转去了四个医院也没能打上破伤风疫苗。\n你在简陋的条件下，给他消毒包扎。\n你的邻居对你致以最为诚挚的谢意。",
                            "fail":"你完全不知道该如何处理这种情况。只能帮他打120，然后默默祈祷救护车会按时到来。",
                            "succeed_type":['immune','reputation'],
                            "succeed_value":['-2','1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":13,
                        "fields":{
                            "description":"你无意中找到了一个低价跑腿的渠道，购买了24个鸡蛋。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你想起有不少跑腿小哥为了避免困在小区里，最近一直睡在桥洞和绿化带中。\n为了避免感染，你让他将鸡蛋拴在了小区护栏上。过一会再亲自去领取。",
                            "fail":"你前往接头地点一手交钱一手交货，取回了鸡蛋。\n丝毫没有意识到自己面临感染的风险。",
                            "succeed_type":['eggs'],
                            "succeed_value":['24'],
                            "fail_type":['eggs','immune'],
                            "fail_value":['24','-2'],
                        }

                    },
                    {
                        "id":19,
                        "fields":{
                            "description":"你在测核酸的时候，注意到小区的绿地和平时有些不太一样。\n你仔细一看，看到小区的阿姨们在挥动锄头，将草地改成菜园。",
                            "type":"strength",
                            "value":"7",
                            "succeed":"你牛高马大，自知能力越大责任越大，便上前去一同帮忙。",
                            "fail":"你是一个肥宅，你生来就属于伟大的互联网，对需要亲自动手的事无能为力。",
                            "succeed_type":['immune'],
                            "succeed_value":['-1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":23,
                        "fields":{
                            "description":"你的邻居不慎被菜刀割到了手，血流不止。\n他上门找你求助。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你注意到手指只是慢慢向外渗血，大概率是静脉受伤。\n你给他采取了压迫止血，你知道用动脉止血方法的话手指可能会坏死。\n邻居辗转去了四个医院也没能打上破伤风疫苗。\n你在简陋的条件下，给他消毒包扎。\n你的邻居对你致以最为诚挚的谢意。",
                            "fail":"你完全不知道该如何处理这种情况。只能帮他打120，然后默默祈祷救护车会按时到来。",
                            "succeed_type":['immune','reputation'],
                            "succeed_value":['-2','1'],
                            "fail_type":['mood'],
                            "fail_value":['-1'],
                        }

                    }, 
                ],
            ]

        self.arc_quests = [
                    {
                        "id":101,
                        "fields":{
                            "description":"任务简介",
                            "type":"检定类型wealth,strength,Ingenuity,Cyber",
                            "value":"检定数值",
                            "succeed":"检定成功文本",
                            "fail":"检定失败文本",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":102,
                        "fields":{
                            "description":"你在床上无聊地玩着手机，突然间远方的人群变得喧闹了起来。",
                            "type":"Cyber",
                            "value":"4",
                            "succeed":"多年网上冲浪的经验告诉你，来者正是王思聪。哟王校长也有今天。",
                            "fail":"你对互联网上的八卦丝毫不感兴趣，根本不认识来者是谁。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":103,
                        "fields":{
                            "description":"住在你斜对角的哥们，除了睡觉上厕所就是在用笔记本电脑办公。",
                            "type":"Cyber",
                            "value":"4",
                            "succeed":"你在上下厕所的间隙趁机瞟了一眼，认出来他事实上在玩魔兽世界。\n但仔细一想，打金团下本跟打工本质上没什么区别。",
                            "fail":"你所热爱的就是你的生活，每天都这样艰苦奋斗的人想必能迎娶白富美，走上人生巅峰吧。\n你如是想到，翻过身子继续做伟大的中国梦。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },                               
                    {
                        "id":104,
                        "fields":{
                            "description":"你隔壁新来的妹子主动跟你打了招呼，当问及她的名字时,\n她迟疑了一下，随即缓缓说出三个字：\n张——麻——子",
                            "type":"Ingenuity",
                            "value":"10",
                            "succeed":"听到这一名字的瞬间，多年的文学修养让你随口吟出一句:\n麻衣白发笑春风，子规声里烟如雨。\n对方神色大喜，立马与你攀谈起来——你是少数知晓这一名字内涵的人。",
                            "fail":"你忍不住笑了出声，对方客套几句后便再也没有和你说过话。",
                            "succeed_type":['friendship_zmz'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":118,
                        "fields":{
                            "description":"今天的核酸检测点看起来和以往有些不太一样，\n负责扫码的医护人员面前多了个大纸箱，\n他在里面透过小洞来检测每一个人的二维码",
                            "type":"Ingenuity",
                            "value":"4",
                            "succeed":"你仔细一想，此举是为了减少扫码时太阳的反光，提高扫码效率。\n简单但实用，这就是劳动人民的智慧。",
                            "fail":"你没有多想，跟着人群向前走去。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":105,
                        "fields":{
                            "description":"今天发的物资除了连花清瘟以外，方舱还给你发了两包袋装中药。",
                            "type":"Ingenuity",
                            "value":"6",
                            "succeed":"你仔细观察发下来的中药，发现上面既没有成分提示，也没有作用和副作用说明。\n谨慎起见，你把这些中药搁置在了一旁。\n很快，旁人的呕吐证明了你的选择是正确的。",
                            "fail":"你来者不拒，将所有中药一饮而尽。\n很快，你开始头晕恶心不适，连通早饭一起吐掉才觉得好一点。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":106,
                        "fields":{
                            "description":"你在测核酸的时候，注意到不远处有人聚集在了一起。\n只见几个蒙面大白将一块白布在地上铺展开。\n上面按一定行列间隔摆满了各种饮料、零食还有方便面。\n一群成年人围在一起，玩起了套圈圈。\n方舱的娱乐活动，让你找回了儿时的感觉。",
                            "type":"strength",
                            "value":"4",
                            "succeed":"你跃跃欲试，上前尝试了几次。\n当你最终回到自己的床位时，身边还多了一听肥宅快乐水。",
                            "fail":"你跃跃欲试，上前尝试了几次。\n但很遗憾，你一次也没有成功。\n需要亲自动手的事对肥宅而言还是太困难了。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },
                    {
                        "id":107,
                        "fields":{
                            "description":"上厕所是隔离期间最为痛苦的一件事。\n每一个隔间都犹如一个潘多拉魔盒，\n你永远不知道打开一扇门后要面对什么。",
                            "type":"Ingenuity",
                            "value":"4",
                            "succeed":"你知道工作人员每天都会定时打扫厕所。\n在经过长时间的观察后，你摸清了他们的工作时间。\n自此，你每次都能享受到最干净的厕所。",
                            "fail":"最开始，你痛苦不堪，\n这里的卫生条件让你想起父亲带你去旱厕的那个遥远下午。\n但没多久你就习惯了这一切。\n毕竟这是非常时期，忍一忍总能过去。",
                            "succeed_type":['default'],
                            "succeed_value":['1'],
                            "fail_type":['default'],
                            "fail_value":['-1'],
                        }

                    },                                                                             


        ]


        #互联网事件

        self.cyber_events2=[
        {
        'description': '你打开了《hyperbolic》，\n双曲空间的渲染方式让你痛苦不堪，你只玩了五分钟，便将午饭吐了出来。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': "你打开了《Patrick's Parabox》，\n这款递归套娃推箱子对轻度玩家而言非常有意思。", 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开了老头环，尽管你的进度只有不到三分之一，\n但仅凭希芙拉河的奇观，就足以让你认定这将会是今年的年度游戏。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': "你打开了《Stephen's Sausage Roll》，\n你发现你完全无法驾驭这款游戏，它能给你带来的就只有痛苦。", 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开了《海平面：禁忌之东》，\n诚如网上所言，一股睡意很快便奔涌而来。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开了《Teardown》，\n精确到像素点的物理运算带来的拆迁体验，使它成为了封城期间最为解压的游戏。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开了《Noita》，\n这款物理运算精确到像素点的肉鸽横版游戏深深吸引了你，它唯一的缺点就是太难了。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开了《横沙之围》\n这款现实题材文字冒险游戏bug多如牛毛，逻辑结构混乱。\n你完全不知道是哪个沙雕做的这款游戏。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开了《Deus eX》，这款游戏故事发生的地点同样在一个叫横沙的城市。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开业界群，发现有不少同行面临断供的压力。\n对此你无能为力，只能默默为他们祈祷。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微博，发现同市的其它地方已经开始用集装箱来封路，像极了《Division》。\n你起身往窗外看，你所处的地段并没有采取这么极端的行为。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微博，围观王校长就连花清瘟事宜与网友正面开团。\n当你想更近一步吃瓜时，王校长的微博号被炸了。\n富家公子风流多年，\n谢幕前急公好义，慷慨畅言。\n这样的剧本你只在电视里见过。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开豆瓣，翻到了一本书叫《文红章说隔离》，\n这本曾经售价70元的书现在只要九块九，还包邮。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开朋友圈，传说其它小区有人带头夺了居委的权，实现了居民自治。\n你很庆幸自己有一个负责的居委会。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微信，居委在群里号召大家尽量节食，少上厕所——\n因为目前没人清理化粪池。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开朋友圈，发现你楼上的极品邻居因为被收了十块钱的跑腿费，将团长捅到了工商局去。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开朋友圈，突然意识到小区的保安队长累倒了，这段时间他一直在超负荷工作。\n你还得知了，他家里还有一个四岁的孩子。\n你无能为力，唯一能做的就是为他们默默祈祷。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你仔细观察了一遍朋友圈，发现大家已经没有精力去嫉妒、去炫耀、去伪装。\n每个人都被蹂躏得失去了形状。只有少部分人渣依然在鼓吹岁月静好，抓特务批汉奸。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微信，碰见居委正劝说大家不要挖小区绿化带里的竹笋，那是观赏类的竹子，不宜食用。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你默默观察业主群，吃了邻居小张的瓜：\n邻居小张一直在公司隔离，有人拍到了他的老婆与别的男人进进出出。\n昨天夜里，小张翻过公司围墙，穿过重重封锁，回到家中捉奸在床。\n情夫的惨叫整个小区都听得见。\n最后，110来了，又把小张抓回了公司隔离。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微信，有人开始在业主群里询问发芽的土豆能不能吃。\n答曰，横沙的土豆可以。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微信，发现小区里的互联网高管开始给大家上网课\n诸如《困境下的创业大法》、《创业进化论》，更重要的是一小时只要价三个鸡蛋。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微信，看见居委在群里告知：\n“如果封控时间内，实在买不到菜，可以先问邻居借一点菜\n实在是借不到，我们也可以帮你想办法。\n反正不建议吃绿化带。”', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开朋友圈，看见女邻居在吐槽：\n“再封下去，就要和老公产生感情了。”', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微博，看到了仓库失火的消息。\n你下意识认为这是火龙烧仓，但你没有证据。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你躺在床上，直勾勾的看着天花板，想起记忆中那个朦胧的身影。\n感情虽然从未离你远去，只不过\n“感”是“流感”的“感”，\n“情”是“疫情”的“情”。\n', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开B站，围观马督工就连花清瘟话题开团。\n你作为灾区人民并不想辩经，但其言其势让你情不自禁联想起一首曲子：\n《I am the Doctor》', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开抖音，尝试融入最新的潮流。\n但你发现自己完全无法忍受其中嘈杂的特效和背景音乐。\n你在这一刻意识到，你已经老了。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微信，发现满屏幕都是404。\n你不知道发生了什么，但你上一次见到这种阵仗还是两年前的春节。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开QQ群，发现自己加的大V群因为高强度冲塔被封了一半。你打开微博，上面的新闻告诉你：\n横沙通往外地的高速公路每一百米就有一名志愿者值守。\n这很离谱，但你知道这是为了防止更为离谱的事发生。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开知乎，看到公知们正对一段录音激昂文字。\n你在这段录音中感受到了什么叫背后有一个强大的祖国。\n当你想再听一遍复盘时，你发现这段录音连通问题一起不见了。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你翻开了辜朝明写的《大衰退时代》，\n尽管你完全看不懂上面的经济学术语\n但里面所描绘的图景使你感同身受。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你坐在电脑前打开了某盗版电影网站，\n上面播放量前三的电影分别是：\n《菜囧》、《辟谣风暴》以及《我不是菜神》。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你翻开了《僵尸世界大战》，这是一本很烂的小说，\n你早年觉得里面充斥着对世界各国的刻板印象。\n但当你再次翻开它时，你突然意识到这其实是魔幻现实主义小说。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开同学群，发现人与人之间的悲欢并不相通。\n乐观的人看起了《经济衰退、复苏、过热和滞涨》，\n悲观的人看起了《救荒本草》，\n抱有希望的人看起了《产业创造的增加值法》，\n不抱希望的人看起了《吉芬商品的诞生与演变》，\n历史唯物主义者看起了《论市场上关于二次经济衰退的观点》，\n唯心主义者看起了《后危机时代的贸易保护主义的分析》', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开业主群，见到业主开始用吃剩下的西瓜皮做菜，清热去火。\n你想起了那首出名的苏北民谣：\n夏天吃瓜皮,冬天吃菜皮。', 
        'type': 'default', 
        'value': '1'},
        {
        'description': '你打开微博，有大量网友声称自己在不知情的情况下被注册了志愿者。\n你试图照着网上的方法查询，但相应的APP已经被巨大的流量冲烂了。', 
        'type': 'default', 
        'value': '1'},
]

        self.cyber_events = [

            '你打开了《hyperbolic》，\n双曲空间的渲染方式让你痛苦不堪，你只玩了五分钟，便将午饭吐了出来。',
            '你打开了《Patrick\'s Parabox》，\n这款递归套娃推箱子对轻度玩家而言非常有意思。',
            '你打开了老头环，尽管你的进度只有不到三分之一，\n但仅凭希芙拉河的奇观，就足以让你认定这将会是今年的年度游戏。',
            '你打开了《Stephen\'s Sausage Roll》，\n你发现你完全无法驾驭这款游戏，它能给你带来的就只有痛苦。',
            '你打开了《海平面：禁忌之东》，\n诚如网上所言，一股睡意很快便奔涌而来。',
            '你打开了《Teardown》，\n精确到像素点的物理运算带来的拆迁体验，使它成为了封城期间最为解压的游戏。',
            '你打开了《Noita》，\n这款物理运算精确到像素点的肉鸽横版游戏深深吸引了你，它唯一的缺点就是太难了。',
            '你打开了《横沙之围》\n这款现实题材文字冒险游戏bug多如牛毛，逻辑结构混乱。\n你完全不知道是哪个沙雕做的这款游戏。',
            '你打开了《Deus eX》，这款游戏故事发生的地点同样在一个叫横沙的城市。',
            '你打开业界群，发现有不少同行面临断供的压力。\n对此你无能为力，只能默默为他们祈祷。',
            '你打开微博，发现同市的其它地方已经开始用集装箱来封路，像极了《Division》。\n你起身往窗外看，你所处的地段并没有采取这么极端的行为。',
            '你打开微博，围观王校长就连花清瘟事宜与网友正面开团。\n当你想更近一步吃瓜时，王校长的微博号被炸了。\n富家公子风流多年，\n谢幕前急公好义，慷慨畅言。\n这样的剧本你只在电视里见过。',
            '你打开豆瓣，翻到了一本书叫《文红章说隔离》，\n这本曾经售价70元的书现在只要九块九，还包邮。',
            '你打开朋友圈，传说其它小区有人带头夺了居委的权，实现了居民自治。\n你很庆幸自己有一个负责的居委会。',
            '你打开微信，居委在群里号召大家尽量节食，少上厕所——\n因为目前没人清理化粪池。',
            '你打开朋友圈，发现你楼上的极品邻居因为被收了十块钱的跑腿费，将团长捅到了工商局去。',
            '你打开朋友圈，突然意识到小区的保安队长累倒了，这段时间他一直在超负荷工作。\n你还得知了，他家里还有一个四岁的孩子。\n你无能为力，唯一能做的就是为他们默默祈祷。',
            '你仔细观察了一遍朋友圈，发现大家已经没有精力去嫉妒、去炫耀、去伪装。\n每个人都被蹂躏得失去了形状。只有少部分人渣依然在鼓吹岁月静好，抓特务批汉奸。',
            '你打开微信，碰见居委正劝说大家不要挖小区绿化带里的竹笋，那是观赏类的竹子，不宜食用。',
            '你默默观察业主群，吃了邻居小张的瓜：\n邻居小张一直在公司隔离，有人拍到了他的老婆与别的男人进进出出。\n昨天夜里，小张翻过公司围墙，穿过重重封锁，回到家中捉奸在床。\n情夫的惨叫整个小区都听得见。\n最后，110来了，又把小张抓回了公司隔离。',
            '你打开微信，有人开始在业主群里询问发芽的土豆能不能吃。\n答曰，横沙的土豆可以。',
            '你打开微信，发现小区里的互联网高管开始给大家上网课\n诸如《困境下的创业大法》、《创业进化论》，更重要的是一小时只要价三个鸡蛋。',
            '你打开微信，看见居委在群里告知：\n“如果封控时间内，实在买不到菜，可以先问邻居借一点菜\n实在是借不到，我们也可以帮你想办法。\n反正不建议吃绿化带。”',
            '你打开朋友圈，看见女邻居在吐槽：\n“再封下去，就要和老公产生感情了。”',
            '你打开微博，看到了仓库失火的消息。\n你下意识认为这是火龙烧仓，但你没有证据。',
            '你躺在床上，直勾勾的看着天花板，想起记忆中那个朦胧的身影。\n感情虽然从未离你远去，只不过\n“感”是“流感”的“感”，\n“情”是“疫情”的“情”。\n',
            '你打开B站，围观马督工就连花清瘟话题开团。\n你作为灾区人民并不想辩经，但其言其势让你情不自禁联想起一首曲子：\n《I am the Doctor》',
            '你打开抖音，尝试融入最新的潮流。\n但你发现自己完全无法忍受其中嘈杂的特效和背景音乐。\n你在这一刻意识到，你已经老了。',
            '你打开微信，发现满屏幕都是404。\n你不知道发生了什么，但你上一次见到这种阵仗还是两年前的春节。',
            '你打开QQ群，发现自己加的大V群因为高强度冲塔被封了一半。'
            '你打开微博，上面的新闻告诉你：\n横沙通往外地的高速公路每一百米就有一名志愿者值守。\n这很离谱，但你知道这是为了防止更为离谱的事发生。',
            '你打开知乎，看到公知们正对一段录音激昂文字。\n你在这段录音中感受到了什么叫背后有一个强大的祖国。\n当你想再听一遍复盘时，你发现这段录音连通问题一起不见了。',
            '你翻开了辜朝明写的《大衰退时代》，\n尽管你完全看不懂上面的经济学术语\n但里面所描绘的图景使你感同身受。',
            '你坐在电脑前打开了某盗版电影网站，\n上面播放量前三的电影分别是：\n《菜囧》、《辟谣风暴》以及《我不是菜神》。',
            '你翻开了《僵尸世界大战》，这是一本很烂的小说，\n你早年觉得里面充斥着对世界各国的刻板印象。\n但当你再次翻开它时，你突然意识到这其实是魔幻现实主义小说。',
            '你打开同学群，发现人与人之间的悲欢并不相通。\n乐观的人看起了《经济衰退、复苏、过热和滞涨》，\n悲观的人看起了《救荒本草》，\n抱有希望的人看起了《产业创造的增加值法》，\n不抱希望的人看起了《吉芬商品的诞生与演变》，\n历史唯物主义者看起了《论市场上关于二次经济衰退的观点》，\n唯心主义者看起了《后危机时代的贸易保护主义的分析》',
            '你打开业主群，见到业主开始用吃剩下的西瓜皮做菜，清热去火。\n你想起了那首出名的苏北民谣：\n夏天吃瓜皮,冬天吃菜皮。',
            '你打开微博，有大量网友声称自己在不知情的情况下被注册了志愿者。\n你试图照着网上的方法查询，但相应的APP已经被巨大的流量冲烂了。',
        ]

        self.dreams = [
                '你最近的情绪有些失落，决定早点睡觉。\n你很快就进入了梦乡。',
                '你最近的情绪有些失落,\n你只在床上玩了一会手机，立马就睡了过去。',
                '你最近的情绪有些失落,甚至对游戏很难提起兴趣，\n你早早就躺在了床上，心理默默祈祷能早日解封。',
            ]

        self.nightmares = [
                '你最近的心情十分低落，你决定早点上床睡觉。\n但你辗转难眠，一直到东方微微见白才得以入睡。',
                '一连串的遭遇使你的心情十分低落，你只想进入梦中与现实脱钩。\n但现实并不如你所愿。',
                '你的心情十分低落。\n你开始认为现实是一个不过是一个尚未醒来的噩梦。\n只有抵达梦境的另一端才能算真正醒来。',             
            ]


        
        #废案
        self.random_events = [
        '又是平常的一天',
          '邻居家团购的鸡被偷走了，愤怒至极。调监控才发现是流浪猫干的。',
          '辽宁支援的物资到了，每家每户发了40斤薯条，团长开始组织团购食用油和番茄酱。',
          '外面开始用集装箱封路，像极了全境封锁的暗区。',
          '邻居老张在封城前屯了三箱可乐五条烟，现在成为了全小区最有钱的人，他老婆在封城前因为这件事把他狠狠骂了一顿，半栋楼都听得见。',
          '你们公司有个哥们因为在隔离酒店人生地不熟，所以一个人团了40箱可乐，被称为独立团团长。',
          '住顶楼的邻居开始翻出了吃灰多年的无人机，从观景池钓锦鲤。',
          '你沉迷打游戏，一直打游戏一直爽。封城的日子简直是太棒了。',
          '你被一阵嘈杂的声音吵醒，有阵阵哭声从楼下传来，一名女子在哭着求退烧药。你感觉心里很难过，自己什么忙也帮不上。',         
          '你沉迷魔兽，一直魔兽一直爽。',                           
          '隔壁小区有人带头把居委干了，实现了居民自治。',
          '居委发物资的时候有一老头执意要按房子数目分，最后把抢不到的鸡蛋全砸了。',
          '楼下测核酸的地方多了个维护秩序的保安，他用喇叭大喊：“你不要唱听我说谢谢你，你也不要跳听我说谢谢你，你能赶紧滚蛋我就谢谢你了”',
          '居委开始用无人机通知每家每户测核酸，真高级。邻居家的小孩久违地发出了欢笑声',
          '楼下的保安队长累倒了，家里还有一个四岁大的孩子，默哀。',
          '居委开始在群里倡导大家尽量节食少上厕所，因为化粪池没人清理。',
          '有人在一楼放了半箱可乐，一天过去以后可乐被换成了各种各样的零食，这可能是封锁以来最暖心的事情。',
          '你的好基友被送进了方舱医院，但当地的环境似乎要让他亲自建设方舱。',
          '居委发现有一户人家每次出来检测核酸的面孔都不一样，一上门调查发现一个出租屋猫了八个人，轮流下楼测核酸交差。',
          '你楼上的极品邻居因为团长收了十块钱运费，把他举报到工商局去了。',
          '由于没有外卖，你感到日渐消瘦，正好减肥。',
          '对面楼有人开始做腊肠了，一打听他们提前买了130斤猪肉。',
          '居委开始查外卖小哥的健康状况，71个跑腿抓到9个双杠，气的居委大妈又在群里骂了一天。',
          '对面小区的物资见底了，迟迟没有补充。他们最终使出了战术核武——让老外出来高举横幅抗议。',
          '居委会给每个人发了一根绳子，用来吊垃圾下楼——你还以为它是用来上吊的。',
          '你仔细观察了一遍朋友圈，发现大家已经没有精力去嫉妒、去炫耀、去伪装。每个人都被蹂躏得失去了形状。只有少部分人渣依然在鼓吹岁月静好，抓特务批汉奸。',
          '业主群里开始分享水培蔬菜的经验。每一个漂亮的瓶子都逃不开种葱的命运，因为葱姜蒜在菜包里不会出现。',
          '团购买的洗衣液是假货，牌子是‘簋月亮’，不是‘蓝月亮’。该死的奸商。',
          '居委帮我们叫了个理发大爷，大家在栏杆前排好队，轮流把头伸出去理发。',
          '有几栋楼陆续变阳了，出于安全考虑大家开始在门口贴字条拒绝下去做核酸。有几家几户还把抗原检测结果贴在了外面。',
          '楼下95岁老太太，每天晚上都会翻出去捡纸皮，还能一个人打五个保安，这身手比你25岁都厉害。',
          '隔壁老王聊天的时候感慨，去年我们还在聊怎么垃圾分类，直追日本；今年开始谈怎么吃饱饭，直追埃塞俄比亚。',
          '居委在业主群里恳求大家不要挖小区绿化带里的竹笋，\n——那是观赏类的竹子，不宜食用。',
          '有心细的业主主要到团购来的物资其实是云南捐赠的物资，马上报了警。警察很快把投机倒把份子抄了家，天网恢恢疏而不漏。',
          '部分业主心理有点奔溃，开始隔着窗户敲碗，很快一呼百应，大家一起高喊“发物资！发物资！”',
          '老王烟瘾犯了，叫骑手跑腿费花了300大洋的私房钱。',
          '你在电视上看到，全球汽车芯片巨头安森美（onsemi）半导体突然宣布将关闭位于上海的全球配送中心并将其迁往新加坡。这下好了，人还没润，工作岗位先润了。',
          '邻居小张一直在公司隔离，有人拍到了他的老婆与别的男人进进出出。\n夜晚，小张翻过公司围墙，穿过重重封锁，回到家中捉奸在床，情夫的惨叫整个小区都听得见。\n最后，110来了，又把小张抓回了公司隔离。',
          '小区里的阿姨不知道从哪整来了锄头，开始将小区的草坪改装为菜园。',
          '居委开始给大家发抗原试剂盒自测，你不小心滴了一滴肥宅快乐水在上面，发现结果是阴性。',
          '你收到了三盒连花清瘟胶囊。',
          '你隔壁的大使馆员工断粮了很久，每天只能吃酱油拌饭度日。业主群开始号召大家尽量支援一些物资过去。你捐出了心爱的肥宅快乐水。',
          '你白天的时候在朋友圈看见了一篇文章，标题名字叫作《勇敢一点，把“zy”写成“自由”》。你当时没有细看，当你再想要复盘时，这篇文章已经404了。',
          '一位女邻居在朋友圈发布感慨：“再封下去，就要和老公产生感情了。”',
          '有业主开始在群里问发芽的土豆能不能吃。',
          '小区里的互联网高管开始给大家上网课，诸如《困境下的创业大法》，一小时只要价三个鸡蛋。',
          '你用三个鸡蛋从邻居那里换了一只猫猫，把玩了一天。',
          '你的邻居决定开始辟谷，不是因为断粮而是因为手纸用完了，你很好心地送了一卷上门，换回了三个鸡蛋。',
        ]